---
type: PrintManager
namespace: Autodesk.Revit.DB
version: 2024
members: 17
tags: [revit-api, class]
---

# PrintManager

`Autodesk.Revit.DB.PrintManager` · Revit 2024 · 17 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Apply | — | `public void Apply ()` |
| Method | SelectNewPrintDriver | — | `public void SelectNewPrintDriver ( string strPrinterName )` |
| Method | SubmitPrint | — | `` |
| Method | SubmitPrint | — | `public bool SubmitPrint ()` |
| Property | Collate | — | `public bool Collate { get ; set ; }` |
| Property | CombinedFile | — | `public bool CombinedFile { get ; set ; }` |
| Property | CopyNumber | — | `public int CopyNumber { get ; set ; }` |
| Property | IsVirtual | — | `public VirtualPrinterType IsVirtual { get ; }` |
| Property | PaperSizes | — | `public PaperSizeSet PaperSizes { get ; }` |
| Property | PaperSources | — | `public PaperSourceSet PaperSources { get ; }` |
| Property | PrintOrderReverse | — | `public bool PrintOrderReverse { get ; set ; }` |
| Property | PrintRange | — | `public PrintRange PrintRange { get ; set ; }` |
| Property | PrintSetup | — | `public PrintSetup PrintSetup { get ; }` |
| Property | PrintToFile | — | `public bool PrintToFile { get ; set ; }` |
| Property | PrintToFileName | — | `public string PrintToFileName { get ; set ; }` |
| Property | PrinterName | — | `public string PrinterName { get ; }` |
| Property | ViewSheetSetting | — | `public ViewSheetSetting ViewSheetSetting { get ; }` |